zephyrproject-rtos/zephyr/drivers/opamp/opamp_stm32_opamp.c
/*
 * Copyright (c) 2025 Alexander Kozhinov <ak.alexander.kozhinov@gmail.com>
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/kernel.h>
#include <zephyr/pm/device.h>
#include <zephyr/logging/log.h>
#include <zephyr/drivers/adc.h>
#include <zephyr/drivers/opamp.h>
#include <zephyr/sys/util_macro.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>

#include <stm32_ll_opamp.h>
#include <stm32_ll_system.h>

LOG_MODULE_REGISTER(opamp_stm32, CONFIG_OPAMP_LOG_LEVEL);

#define DT_DRV_COMPAT st_stm32_opamp

/* There is a spell-mistake in original driver - L268, stm32g4xx_ll_opamp.h
 * use custom definitions for the macros to avoid modifying original driver
 */
#define OPAMP_INTERNAL_OUTPUT_DISABLED (0x00000000UL)
#define OPAMP_INTERNAL_OUTPUT_ENABLED OPAMP_CSR_OPAMPINTEN

#define STM32_OPAMP_TRIM_VAL_MAX 0x1f /* maximum allowed trimming value */
#define STM32_OPAMP_TRIM_VAL_UNDEFINED 0xff /* undefined trimming value */

/*
 * Definitions to map Zephyr API input selections to LL driver values
 * This definition section is needed for simpler DTS bindings match to LL values
 * Without macros below the macros usage for DTS bindings would be clumsy and unclear
 */
#define OPAMP_INM_NONE (UINT32_MAX - 1) /* used to represent states not present in ll */
/* LL_OPAMP_INPUT_INVERT_CONNECT_NO: only for OPAMP in follower or PGA
 * with positive gain without bias
 */
#define OPAMP_INM_NC LL_OPAMP_INPUT_INVERT_CONNECT_NO
#define OPAMP_INM_VINM0 LL_OPAMP_INPUT_INVERT_IO0
#define OPAMP_INM_VINM1 LL_OPAMP_INPUT_INVERT_IO1

#define OPAMP_INM_SEC_NONE (UINT32_MAX - 2) /* used to represent states not present in ll */
/* only applicable in standalone mode */
#define OPAMP_INM_SEC_VINM0 LL_OPAMP_INPUT_INVERT_IO0_SEC
/* only applicable in standalone mode */
#define OPAMP_INM_SEC_VINM1 LL_OPAMP_INPUT_INVERT_IO1_SEC

#define OPAMP_INP_VINP0 LL_OPAMP_INPUT_NONINVERT_IO0
#define OPAMP_INP_VINP1 LL_OPAMP_INPUT_NONINVERT_IO1
#define OPAMP_INP_VINP2 LL_OPAMP_INPUT_NONINVERT_IO2
#define OPAMP_INP_VINP3 LL_OPAMP_INPUT_NONINVERT_IO3
#define OPAMP_INP_DAC LL_OPAMP_INPUT_NONINVERT_DAC

#define OPAMP_INP_SEC_NONE (UINT32_MAX - 2) /* used to represent states not present in ll */
#define OPAMP_INP_SEC_VINP0 LL_OPAMP_INPUT_NONINVERT_IO0_SEC
#define OPAMP_INP_SEC_VINP1 LL_OPAMP_INPUT_NONINVERT_IO1_SEC
#define OPAMP_INP_SEC_VINP2 LL_OPAMP_INPUT_NONINVERT_IO2_SEC
#define OPAMP_INP_SEC_VINP3 LL_OPAMP_INPUT_NONINVERT_IO3_SEC
#define OPAMP_INP_SEC_DAC LL_OPAMP_INPUT_NONINVERT_DAC_SEC

#define OPAMP_INM_FILTERING_NONE (0)
#define OPAMP_INM_FILTERING_VINM0 (1)
#define OPAMP_INM_FILTERING_VINM1 (2)

struct stm32_opamp_config {
	OPAMP_TypeDef *opamp;
	struct stm32_pclken *pclken;
	const struct pinctrl_dev_config *pincfg;
	const struct adc_dt_spec *adc_ch; /* ADC channel opamp is connected to */
	const uint32_t inm[2];        /* Primary and secondary entries */
	const uint32_t inp[2];        /* Primary and secondary entries */
	uint32_t power_mode;
	uint32_t inputs_mux_mode;
	uint32_t inm_filtering;
	const size_t pclk_len;
	uint8_t functional_mode;
	uint8_t pmos_trimming_value;
	uint8_t nmos_trimming_value;
	bool lock_enable;
	bool self_calibration;
};

struct stm32_opamp_data {
	struct k_mutex dev_mtx; /* Sync between device accesses */
};

static void stm32_opamp_config_log_dbg(const struct device *dev)
{
	const struct stm32_opamp_config *cfg = dev->config;
	const char *self_calib_str = cfg->self_calibration ? "true" : "false";
	const char *lock_enable_str = cfg->lock_enable ? "true" : "false";
	const struct adc_dt_spec *adc_ch = cfg->adc_ch;
	const int adc_ch_id = adc_ch != NULL ? adc_ch->channel_id : -1;
	const struct device *adc_dev = adc_ch != NULL ? adc_ch->dev : NULL;
	const char *adc_dev_name = adc_dev != NULL ? adc_dev->name : "none";

	LOG_DBG("%s config:\n"
		"  functional_mode: 0x%x\n"
		"  power_mode: 0x%x\n"
		"  inm: {0x%08x,0x%08x}\n"
		"  inp: {0x%08x,0x%08x}\n"
		"  adc_ch: %s channel: %d\n"
		"  lock_enable: %s\n"
		"  self_calibration: %s\n"
		"  inputs_mux_mode: 0x%x\n"
		"  inm_filtering: 0x%x\n"
		"  pmos_trimming_value: 0x%02x\n"
		"  nmos_trimming_value: 0x%02x\n"
		"  OPAMPx_CSR: 0x%08x\n"
		"  OPAMPx_TCMR: 0x%08x\n",
		dev->name, cfg->functional_mode, cfg->power_mode,
		cfg->inm[0], cfg->inm[1], cfg->inp[0], cfg->inp[1],
		adc_dev_name, adc_ch_id, lock_enable_str,
		self_calib_str, cfg->inputs_mux_mode, cfg->inm_filtering,
		(uint32_t)cfg->pmos_trimming_value, (uint32_t)cfg->nmos_trimming_value,
		(uint32_t)cfg->opamp->CSR, (uint32_t)cfg->opamp->TCMR);
}

static bool stm32_opamp_is_locked(const struct device *dev)
{
	const struct stm32_opamp_config *cfg = dev->config;
	OPAMP_TypeDef *opamp = cfg->opamp;

	if (cfg->inputs_mux_mode != LL_OPAMP_INPUT_MUX_DISABLE) {
		return LL_OPAMP_IsLocked(opamp) && LL_OPAMP_IsTimerMuxLocked(opamp);
	}

	return LL_OPAMP_IsLocked(opamp);
}

static void stm32_opamp_lock(const struct device *dev)
{
	const struct stm32_opamp_config *cfg = dev->config;
	OPAMP_TypeDef *opamp = cfg->opamp;

	LL_OPAMP_Lock(opamp);
	if (cfg->inputs_mux_mode != LL_OPAMP_INPUT_MUX_DISABLE) {
		LL_OPAMP_LockTimerMux(opamp);
	}
}

static int stm32_opamp_pm_callback(const struct device *dev, enum pm_device_action action)
{
	const struct stm32_opamp_config *cfg = dev->config;
	OPAMP_TypeDef *opamp = cfg->opamp;

	if (stm32_opamp_is_locked(dev)) {
		LOG_DBG("%s: locked opamp do not accept action: %d", dev->name, action);
		return -EPERM;
	}

	if (action == PM_DEVICE_ACTION_RESUME) {
		LL_OPAMP_Enable(opamp);
		if (cfg->lock_enable) {
			stm32_opamp_lock(dev);
		}
	}

	if (action == PM_DEVICE_ACTION_SUSPEND) {
		LL_OPAMP_Disable(opamp);
	}

	return 0;
}

static int stm32_opamp_set_gain(const struct device *dev, enum opamp_gain gain)
{
	const struct stm32_opamp_config *cfg = dev->config;
	struct stm32_opamp_data *data = dev->data;
	OPAMP_TypeDef *opamp = cfg->opamp;
	uint32_t ll_gain;

	k_mutex_lock(&data->dev_mtx, K_FOREVER);

