zephyrproject-rtos/zephyr/drivers/opamp/opamp_stm32_opamp.c
	if (stm32_opamp_is_locked(dev)) {
		LOG_ERR("%s: locked", dev->name);
		k_mutex_unlock(&data->dev_mtx);
		return -EPERM;
	}

	if (cfg->functional_mode == OPAMP_FUNCTIONAL_MODE_FOLLOWER ||
	    cfg->functional_mode == OPAMP_FUNCTIONAL_MODE_STANDALONE) {
		/* Avoid writing gain value to registers in standalone or follower mode */
		LOG_DBG("%s: not supported in %s", dev->name,
			cfg->functional_mode == OPAMP_FUNCTIONAL_MODE_FOLLOWER ? "follower"
									       : "standalone");
		k_mutex_unlock(&data->dev_mtx);
		return 0;
	}

	/* In opamp-controller.yaml there are no negative gains present, but
	 * inverting and non-inverting modes instead. Therefore OPAMP_GAIN_1
	 * corresponds to -1 gain in inverting mode, and +2 gain in non-inverting mode.
	 */
	switch (gain) {
	case OPAMP_GAIN_1:
	case OPAMP_GAIN_2:
		ll_gain = LL_OPAMP_PGA_GAIN_2_OR_MINUS_1;
		break;
	case OPAMP_GAIN_3:
	case OPAMP_GAIN_4:
		ll_gain = LL_OPAMP_PGA_GAIN_4_OR_MINUS_3;
		break;
	case OPAMP_GAIN_7:
	case OPAMP_GAIN_8:
		ll_gain = LL_OPAMP_PGA_GAIN_8_OR_MINUS_7;
		break;
	case OPAMP_GAIN_15:
	case OPAMP_GAIN_16:
		ll_gain = LL_OPAMP_PGA_GAIN_16_OR_MINUS_15;
		break;
	case OPAMP_GAIN_31:
	case OPAMP_GAIN_32:
		ll_gain = LL_OPAMP_PGA_GAIN_32_OR_MINUS_31;
		break;
	case OPAMP_GAIN_63:
	case OPAMP_GAIN_64:
		ll_gain = LL_OPAMP_PGA_GAIN_64_OR_MINUS_63;
		break;
	default:
		LOG_ERR("%s: invalid gain %d", dev->name, gain);
		k_mutex_unlock(&data->dev_mtx);
		return -EINVAL;
	}

	LL_OPAMP_SetPGAGain(opamp, ll_gain);

	k_mutex_unlock(&data->dev_mtx);
	return 0;
}

static int stm32_opamp_set_functional_mode(const struct device *dev)
{
	const struct stm32_opamp_config *cfg = dev->config;
	OPAMP_TypeDef *opamp = cfg->opamp;
	uint32_t ll_functional_mode = UINT32_MAX;

	/* NOTE: The register values for each mode are defined in AN5306 document */
	switch (cfg->functional_mode) {
	case OPAMP_FUNCTIONAL_MODE_STANDALONE:
		LOG_DBG("%s: functional_mode: standalone", dev->name);
		/* Standalone mode: External feedback network defines gain
		 *	INP user defined (OPAMPx_CSR.VP_SEL - defined by DTS)
		 *	INM tied to VINM0 (OPAMPx_CSR.VM_SEL = b00)
		 *	PGA_GAIN = b00000 (reset value)
		 */
		/* Standalone mode requires explicit input configuration */
		LL_OPAMP_SetInputNonInverting(opamp, cfg->inp[0]);

		/* INM tied to VINM0 */
		LL_OPAMP_SetInputInverting(opamp, LL_OPAMP_INPUT_INVERT_IO0);

		/* Configure secondary inputs if timer-controlled mux is enabled */
		if (cfg->inputs_mux_mode != LL_OPAMP_INPUT_MUX_DISABLE &&
		    cfg->inm[1] != OPAMP_INM_SEC_NONE) {
			LL_OPAMP_SetInputInvertingSecondary(opamp, cfg->inm[1]);
		}
		if (cfg->inputs_mux_mode != LL_OPAMP_INPUT_MUX_DISABLE &&
		    cfg->inp[1] != OPAMP_INP_SEC_NONE) {
			LL_OPAMP_SetInputNonInvertingSecondary(opamp, cfg->inp[1]);
		}
		ll_functional_mode = LL_OPAMP_MODE_STANDALONE;
		break;
	case OPAMP_FUNCTIONAL_MODE_FOLLOWER:
		LOG_DBG("%s: functional_mode: follower", dev->name);
		/* Follower mode:
		 *	INP connected to input signal (VP_SEL - defined by DTS)
		 *	INM internally connected to VOUT (VM_SEL = b11)
		 *	PGA_GAIN = b00000 (reset value)
		 */

		/* Follower mode: Only configure non-inverting input INP */
		LL_OPAMP_SetInputNonInverting(opamp, cfg->inp[0]);

		/*
		 * INM shall be forced to be not-connected -
		 * the mode itself will define right connection
		 */
		LL_OPAMP_SetInputInverting(opamp, OPAMP_INM_NC);

		/* Configure secondary inputs if timer-controlled mux is enabled */
		if (cfg->inputs_mux_mode != LL_OPAMP_INPUT_MUX_DISABLE &&
		    cfg->inp[1] != OPAMP_INP_SEC_NONE) {
			LL_OPAMP_SetInputNonInvertingSecondary(opamp, cfg->inp[1]);
		}
		ll_functional_mode = LL_OPAMP_MODE_FOLLOWER;
		break;
	case OPAMP_FUNCTIONAL_MODE_INVERTING:
		/* INM shall be connected to VINM0 in inverting-mode */
		if (cfg->inm[0] != OPAMP_INM_VINM0) {
			LOG_ERR("%s: expected inm to be set to VINM0", dev->name);
			LOG_DBG("%s: VINM0 (0x%lx) != 0x%x", dev->name, OPAMP_INM_VINM0,
				cfg->inm[0]);
			return -EINVAL;
		}
		__fallthrough;
	case OPAMP_FUNCTIONAL_MODE_NON_INVERTING:
		if (cfg->functional_mode == OPAMP_FUNCTIONAL_MODE_INVERTING) {
			LOG_DBG("%s: functional_mode: inverting", dev->name);
		} else {
			LOG_DBG("%s: functional_mode: non_inverting", dev->name);
		}
		/* PGA mode: Gain is set by resistor array feedback
		 * There are four following sub-modes supported:
		 * - LL_OPAMP_MODE_PGA:
		 *	INP is connected to VINMx thus serving as an input signal pin.
		 *		It will be selected by inp DTS property.
		 *	VINPx secondary may be selected too to be muxed by timer
		 *		(see: st,inputs-mux-mode DTS property)
		 *	INM is connected to resistor array feedback (VM_SEL = b10)
		 *	INM is NOT connected to any VINMx (e.g. external pins)
		 *	The OPAMP is in NON-INVERTING MODE with
		 *	positive gains: +2, +4, +8, +16, +32, +64
		 *
		 * - LL_OPAMP_MODE_PGA_IO0:
		 *	Same as LL_OPAMP_MODE_PGA
		 *	INM is additionally connected to VINM0 for filtering
		 *		(see: st,inm-filtering DTS property)
		 *
		 * - LL_OPAMP_MODE_PGA_IO0_BIAS:
		 *	Same as LL_OPAMP_MODE_PGA
		 *	The INM is connected to VINMx
		 *		- Input signal on VINMx, bias on VINPx:
		 *			- negative gains: -1, -3, -7, -15, -31, -63
		 *		- Bias on VINMx, input signal on VINPx:
		 *			- positive gains: +2, +4, +8, +16, +32, +64
		 *
		 * - LL_OPAMP_MODE_PGA_IO0_IO1_BIAS:
		 *	Same as LL_OPAMP_MODE_PGA
		 *	The INM is connected to VINMx
		 *		- Input signal on VINMx, bias on VINPx:
		 *			- negative gains: -1, -3, -7, -15, -31, -63
		 *		- Bias on VINMx, input signal on VINPx:
		 *			- positive gains: +2, +4, +8, +16, +32, +64
		 *	VINM1 is connected too for filtering
		 */

		/* INP is always configured in ALL PGA modes */
		LL_OPAMP_SetInputNonInverting(opamp, cfg->inp[0]);

		/* Configure secondary inputs if timer-controlled mux is enabled */
		if (cfg->inputs_mux_mode != LL_OPAMP_INPUT_MUX_DISABLE &&
		    cfg->inp[1] != OPAMP_INP_SEC_NONE) {
			LL_OPAMP_SetInputNonInvertingSecondary(opamp, cfg->inp[1]);
		}

		/* Select PGA general mode - precise later */
		ll_functional_mode = LL_OPAMP_MODE_PGA;
		if (cfg->inm_filtering == OPAMP_INM_FILTERING_VINM0) {
			/* INM filtering requested on VINM0 and
			 * INM defined by DTS is don't care
			 */
			ll_functional_mode = LL_OPAMP_MODE_PGA_IO0;
		}

		/* Configure INM input if needed */
		if (cfg->functional_mode == OPAMP_FUNCTIONAL_MODE_INVERTING) {
			/* INM shall be connected to VINM0, which will be configured
			 * by PGA mode bits, therefore there is no need to setup INM here
			 */
			/* Select PGA mode */
			ll_functional_mode = LL_OPAMP_MODE_PGA_IO0_BIAS;
			if (cfg->inm_filtering == OPAMP_INM_FILTERING_VINM1) {
				/* INM filtering requested on VINM1 */
				ll_functional_mode = LL_OPAMP_MODE_PGA_IO0_IO1_BIAS;
			}
		}
		break;
	default:
		LOG_ERR("%s: invalid functional_mode: %d", dev->name, cfg->functional_mode);
		return -EINVAL;
	}

