zephyrproject-rtos/zephyr/drivers/opamp/opamp_stm32_opamp.c
	/* Ensure OPAMP is in functional mode (not calibration mode) */
	LL_OPAMP_SetMode(opamp, LL_OPAMP_MODE_FUNCTIONAL);
	LL_OPAMP_SetPGAGain(opamp, 0); /* gain reset value */

	/* Set the functional mode - this configures internal connections */
	LL_OPAMP_SetFunctionalMode(opamp, ll_functional_mode);

	return 0;
}

static int stm32_opamp_get_calout(const struct device *dev, struct adc_sequence *adc_seq,
				  uint32_t *calout)
{
	const struct stm32_opamp_config *cfg = dev->config;
	OPAMP_TypeDef *opamp = cfg->opamp;
	const struct adc_dt_spec *adc_ch = cfg->adc_ch;

	if (LL_OPAMP_GetInternalOutput(opamp) == OPAMP_INTERNAL_OUTPUT_DISABLED || adc_ch == NULL) {
		/* Internal output to ADC is disabled - use CALOUT transition check */
		*calout = LL_OPAMP_IsCalibrationOutputSet(opamp);
		return 0;
	}

	if (adc_read_dt(adc_ch, adc_seq) < 0) {
		LOG_ERR("%s: could not read adc channel #%d", adc_ch->dev->name,
			adc_ch->channel_id);
		return -EIO;
	}

	/*
	 * A change of CALOUT from 1 to 0 corresponds to the change of ADC output data
	 * from values close to the maximum ADC output to values close to the minimum
	 * ADC output (the ADC works as a comparator connected to the OPAMP output).
	 * source: RM0440 Rev 9 pp. 785/2140
	 */
	*calout = (uint32_t)sys_read16((mem_addr_t)adc_seq->buffer);
	return 0;
}

static int stm32_opamp_adc_calib_configure(const struct device *dev, struct adc_sequence *adc_seq)
{
	const struct stm32_opamp_config *cfg = dev->config;
	const struct adc_dt_spec *adc_ch = cfg->adc_ch;
	OPAMP_TypeDef *opamp = cfg->opamp;
	int ret = 0;

	if (LL_OPAMP_GetInternalOutput(opamp) == OPAMP_INTERNAL_OUTPUT_ENABLED && adc_ch != NULL) {
		ret = adc_channel_setup_dt(adc_ch);
		if (ret < 0) {
			LOG_ERR("%s: could not setup channel #%d", adc_ch->dev->name,
				adc_ch->channel_id);
			return ret;
		}

		ret = adc_sequence_init_dt(adc_ch, adc_seq);
		if (ret < 0) {
			LOG_ERR("%s: could not setup adc sequence for channel #%d",
				adc_ch->dev->name, adc_ch->channel_id);
			return ret;
		}
	}
	return ret;
}

/**
 * @brief Self-calibrate the OPAMP
 *
 * @param dev - OPAMP device
 * @return int - 0 on success, negative error code on failure
 */
static int stm32_opamp_self_calibration(const struct device *dev)
{
	const struct stm32_opamp_config *cfg = dev->config;
	OPAMP_TypeDef *opamp = cfg->opamp;
	int ret = 0;

	uint16_t adc_buf = 0;
	struct adc_sequence adc_seq = {
		.buffer = &adc_buf,
		.buffer_size = sizeof(adc_buf),
		.calibrate = true,
	};

	/* Configure ADC for calibration if internal output is enabled */
	ret = stm32_opamp_adc_calib_configure(dev, &adc_seq);
	if (ret < 0) {
		return ret;
	}

	/* User trimming values are used for offset calibration */
	LL_OPAMP_SetTrimmingMode(opamp, LL_OPAMP_TRIMMING_USER);

	/* Enable calibration mode */
	LL_OPAMP_SetMode(opamp, LL_OPAMP_MODE_CALIBRATION);

	/* Enable opamp */
	LL_OPAMP_Enable(opamp);

	const uint32_t trimming_type[] = {
		LL_OPAMP_TRIMMING_NMOS_VREF_90PC_VDDA, /* 1st calibration - N - 90% Vref */
		LL_OPAMP_TRIMMING_PMOS_VREF_10PC_VDDA  /* 2nd calibration - P - 10% Vref */
	};

	for (size_t i = 0; i < ARRAY_SIZE(trimming_type); i++) {
		LOG_DBG("%s: calibrating %s", dev->name, i == 0 ? "NMOS" : "PMOS");
		uint32_t trimming_value = 0;
		uint32_t trimming_min = 0;
		uint32_t calout_min = UINT32_MAX;
		uint32_t calout = 0;
		uint32_t calout_prev = 0;
		bool calib_done = false;

		LL_OPAMP_SetCalibrationSelection(opamp, trimming_type[i]);
		while (trimming_value < STM32_OPAMP_TRIM_VAL_MAX && !calib_done) {
			ret = stm32_opamp_get_calout(dev, &adc_seq, &calout);
			if (ret < 0) {
				break;
			}
			LL_OPAMP_SetTrimmingValue(opamp, trimming_type[i], trimming_value);
			/* Wait for offset trimming max time (tOFFTRIMmax >= 2 ms)
			 * source: RM0440 Rev 9 pp. 785/2140 for stm32g4
			 */
			k_msleep(2);
			trimming_value++;

			if (LL_OPAMP_GetInternalOutput(opamp) !=
			    OPAMP_INTERNAL_OUTPUT_DISABLED) {
				/* ADC based calibration */
				if (calout < calout_min) {
					calout_min = calout;
					trimming_min = trimming_value;
				}
			} else {
				/* CALOUT based calibration: transition from 1 to 0 */
				if (calout_prev == 0x1 && calout == 0x0) {
					trimming_min = trimming_value;
					calib_done = true;
				}
			}

			LOG_DBG("trimming_min: 0x%x; trimming_value: 0x%x; "
				"calout_prev: 0x%x; calout: 0x%x; "
				"calout_min: 0x%x; adc_buf: 0x%x",
				trimming_min, trimming_value, calout_prev, calout, calout_min,
				adc_buf);

			calout_prev = calout;
		}

		if (ret == 0) {
			LL_OPAMP_SetTrimmingValue(opamp, trimming_type[i], trimming_min);
			LOG_DBG("%s: calibration succeed, trimming value: 0x%x", dev->name,
				trimming_min);
		} else {
			LOG_DBG("%s: calibration failed", dev->name);
			break;
		}
	}

	/* Revert register values */
	LL_OPAMP_SetCalibrationSelection(opamp, 0); /* set to register reset value */
	LL_OPAMP_SetMode(opamp, LL_OPAMP_MODE_FUNCTIONAL);
	LL_OPAMP_Disable(opamp);

	return ret;
}

static int stm32_opamp_init(const struct device *dev)
{
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	const struct stm32_opamp_config *cfg = dev->config;
	struct stm32_opamp_data *data = dev->data;
	const struct adc_dt_spec *adc_ch = cfg->adc_ch;
	OPAMP_TypeDef *opamp = cfg->opamp;
	int ret = 0;

	if (!device_is_ready(clk)) {
		return -ENODEV;
	}

	if (adc_ch != NULL && adc_ch->dev != NULL && !adc_is_ready_dt(adc_ch)) {
		LOG_ERR("%s ADC device not ready", adc_ch->dev->name);
		return -ENODEV;
	}

	/* Enable OPAMP bus clock */
	ret = clock_control_on(clk, (clock_control_subsys_t)&cfg->pclken[0]);
	if (ret != 0) {
		LOG_ERR("%s clock op failed (%d)", dev->name, ret);
		return ret;
	}

	/* Configure OPAMP inputs as specified in Device Tree */
	ret = pinctrl_apply_state(cfg->pincfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("%s pinctrl setup failed (%d)", dev->name, ret);
		return ret;
	}

	k_mutex_lock(&data->dev_mtx, K_FOREVER);

	/* Power mode shall be set before calibration - since calibration is mode dependent */
	LL_OPAMP_SetPowerMode(opamp, cfg->power_mode);

	if (adc_ch != NULL && adc_ch->dev != NULL) {
		/* Enable internal output to ADC if ADC channel is defined */
		LL_OPAMP_SetInternalOutput(opamp, OPAMP_INTERNAL_OUTPUT_ENABLED);
	} else {
		/* Disable internal output to ADC */
		LL_OPAMP_SetInternalOutput(opamp, OPAMP_INTERNAL_OUTPUT_DISABLED);
	}

	if (cfg->self_calibration) {
		ret = stm32_opamp_self_calibration(dev);
		if (ret != 0) {
			k_mutex_unlock(&data->dev_mtx);
			return ret;
		}
	}

	/* Apply trimming values defined explicitly in DTS. OPAMPx_CSR.USERTRIM
	 * shall be set, before setting trimming values in OPAMPx_CSR.TRIMOFFSETN
	 * and OPAMPx_CSR.TRIMOFFSETP (RM0440 Rev 9 pp. 788/2140).
	 */
	if (cfg->pmos_trimming_value != STM32_OPAMP_TRIM_VAL_UNDEFINED) {
		LL_OPAMP_SetTrimmingMode(opamp, LL_OPAMP_TRIMMING_USER);
		LL_OPAMP_SetTrimmingValue(opamp, LL_OPAMP_TRIMMING_PMOS,
						cfg->pmos_trimming_value);
	}

	if (cfg->nmos_trimming_value != STM32_OPAMP_TRIM_VAL_UNDEFINED) {
		LL_OPAMP_SetTrimmingMode(opamp, LL_OPAMP_TRIMMING_USER);
		LL_OPAMP_SetTrimmingValue(opamp, LL_OPAMP_TRIMMING_NMOS,
						cfg->nmos_trimming_value);
	}

	ret = stm32_opamp_set_functional_mode(dev);
	if (ret != 0) {
		k_mutex_unlock(&data->dev_mtx);
		return ret;
	}

