zephyrproject-rtos/zephyr/drivers/opamp/opamp_stm32_opamp.c
	LL_OPAMP_SetInputsMuxMode(opamp, cfg->inputs_mux_mode);

	/* It is always very useful to show register configuration in debug mode */
	stm32_opamp_config_log_dbg(dev);

	k_mutex_unlock(&data->dev_mtx);
	return pm_device_driver_init(dev, stm32_opamp_pm_callback);
}

#define STM32_OPAMP_DT_POWER_MODE(inst)                                                            \
	CONCAT(LL_OPAMP_POWERMODE_, DT_INST_STRING_TOKEN(inst, st_power_mode))

#define STM32_OPAMP_DT_INPUTS_MUX_MODE(inst)                                                       \
	CONCAT(LL_OPAMP_INPUT_MUX_, DT_INST_STRING_TOKEN(inst, st_inputs_mux_mode))

#define STM32_OPAMP_DT_INM_FILTERING(inst)                                                         \
	CONCAT(OPAMP_INM_FILTERING_, DT_INST_STRING_TOKEN(inst, st_inm_filtering))

#define STM32_OPAMP_DT_INM_PRIMARY(inst)                                                           \
	CONCAT(OPAMP_INM_, DT_INST_STRING_TOKEN_BY_IDX_OR(inst, inm, 0, NONE))

#define STM32_OPAMP_DT_INM_SECONDARY(inst)                                                         \
	CONCAT(OPAMP_INM_SEC_, DT_INST_STRING_TOKEN_BY_IDX_OR(inst, inm, 1, NONE))

#define STM32_OPAMP_DT_INP_PRIMARY(inst)                                                           \
	CONCAT(OPAMP_INP_, DT_INST_STRING_TOKEN_BY_IDX(inst, inp, 0))

#define STM32_OPAMP_DT_INP_SECONDARY(inst)                                                         \
	CONCAT(OPAMP_INP_SEC_, DT_INST_STRING_TOKEN_BY_IDX_OR(inst, inp, 1, NONE))

#define STM32_OPAMP_TRIMMING_ASSERT_IMPL(inst, value)                                              \
	BUILD_ASSERT(DT_INST_PROP(inst, value) <= STM32_OPAMP_TRIM_VAL_MAX,                        \
		     "The value exceeds maximum allowed trimming value STM32_OPAMP_TRIM_VAL_MAX")

/* This assert guarantees a value is always in allowed range at compile time */
#define STM32_OPAMP_TRIMMING_ASSERT(inst, value)                                                   \
	IF_ENABLED(DT_INST_NODE_HAS_PROP(inst, value),                                            \
		    (STM32_OPAMP_TRIMMING_ASSERT_IMPL(inst, value)))

#define STM32_OPAMP_DT_PMOS_TRIMMING(inst)                                                         \
	DT_INST_PROP_OR(inst, st_pmos_trimming_value, STM32_OPAMP_TRIM_VAL_UNDEFINED)

#define STM32_OPAMP_DT_NMOS_TRIMMING(inst)                                                         \
	DT_INST_PROP_OR(inst, st_nmos_trimming_value, STM32_OPAMP_TRIM_VAL_UNDEFINED)

#define _STM32_OPAMP_DT_ADC_CHANNEL_DEFINE_1(inst)                                                 \
	static const struct adc_dt_spec adc_ch_##inst = ADC_DT_SPEC_INST_GET(inst);

#define _STM32_OPAMP_DT_ADC_CHANNEL_DEFINE_0(inst) /* empty */

#define STM32_OPAMP_DT_ADC_CHANNEL_DEFINE(inst)                                                    \
	UTIL_CAT(_STM32_OPAMP_DT_ADC_CHANNEL_DEFINE_,                                              \
		 UTIL_BOOL(DT_INST_NODE_HAS_PROP(inst, io_channels)))(inst)

#define STM32_OPAMP_ADC_CHANNEL_PTR(inst)                                                          \
	COND_CODE_1(DT_INST_NODE_HAS_PROP(inst, io_channels), (&adc_ch_##inst), (NULL))

static DEVICE_API(opamp, opamp_api) = {
	.set_gain = stm32_opamp_set_gain,
};

#define STM32_OPAMP_DEVICE(inst)                                                                   \
	PINCTRL_DT_INST_DEFINE(inst);                                                              \
                                                                                                   \
	static struct stm32_pclken stm32_pclken_##inst[] = STM32_DT_INST_CLOCKS(inst);             \
                                                                                                   \
	STM32_OPAMP_TRIMMING_ASSERT(inst, st_pmos_trimming_value);                                 \
	STM32_OPAMP_TRIMMING_ASSERT(inst, st_nmos_trimming_value);                                 \
                                                                                                   \
	STM32_OPAMP_DT_ADC_CHANNEL_DEFINE(inst)                                                    \
                                                                                                   \
	static const struct stm32_opamp_config stm32_opamp_config_##inst = {                       \
		.opamp = (OPAMP_TypeDef *)DT_INST_REG_ADDR(inst),                                  \
		.functional_mode = DT_INST_ENUM_IDX(inst, functional_mode),                        \
		.power_mode = STM32_OPAMP_DT_POWER_MODE(inst),                                     \
		.inp = {STM32_OPAMP_DT_INP_PRIMARY(inst), STM32_OPAMP_DT_INP_SECONDARY(inst)},     \
		.inm = {STM32_OPAMP_DT_INM_PRIMARY(inst), STM32_OPAMP_DT_INM_SECONDARY(inst)},     \
		.adc_ch = STM32_OPAMP_ADC_CHANNEL_PTR(inst),                                       \
		.lock_enable = DT_INST_PROP(inst, st_lock_enable),                                 \
		.self_calibration = DT_INST_PROP(inst, st_enable_self_calibration),                \
		.inputs_mux_mode = STM32_OPAMP_DT_INPUTS_MUX_MODE(inst),                           \
		.inm_filtering = STM32_OPAMP_DT_INM_FILTERING(inst),                               \
		.pmos_trimming_value = STM32_OPAMP_DT_PMOS_TRIMMING(inst),                         \
		.nmos_trimming_value = STM32_OPAMP_DT_NMOS_TRIMMING(inst),                         \
		.pclken = stm32_pclken_##inst,                                                     \
		.pclk_len = DT_INST_NUM_CLOCKS(inst),                                              \
		.pincfg = PINCTRL_DT_INST_DEV_CONFIG_GET(inst),                                    \
	};                                                                                         \
                                                                                                   \
	static struct stm32_opamp_data stm32_opamp_data_##inst = {                                 \
		.dev_mtx = Z_MUTEX_INITIALIZER(stm32_opamp_data_##inst.dev_mtx),                   \
	};                                                                                         \
                                                                                                   \
	PM_DEVICE_DT_INST_DEFINE(inst, stm32_opamp_pm_callback);                                   \
                                                                                                   \
	DEVICE_DT_INST_DEFINE(inst, stm32_opamp_init, PM_DEVICE_DT_INST_GET(inst),                 \
			      &stm32_opamp_data_##inst, &stm32_opamp_config_##inst, POST_KERNEL,   \
			      CONFIG_OPAMP_INIT_PRIORITY, &opamp_api);

DT_INST_FOREACH_STATUS_OKAY(STM32_OPAMP_DEVICE)
